Repository: lsoft/FreeAIr
Catalog: FreeAIr/Resources/Resources.*.resx
Languages: ru, zh_hans

# Code_NoSelectedCode
source: Cannot obtain selected block of code.
ru: Не могу получить выделенный блок кода.
zh_hans: 无法获取所选代码块。

# Code_NoToken
source: Please setup API endpoint and access token in FreeAIr control panel. If you are using local LLM enter any string into token option.
ru: Пожалуйста, задайте ендпоинт API и токен доступа в FreeAIr Control Panel. Если Вы используете локальную LLM и токен не нужен, введите в его поле произвольную строку.
zh_hans: 请在 FreeAIr 控制面板中设置 API 端点和访问令牌。如果您使用本地 LLM，请在令牌选项中输入任意字符串。

source: Error
ru: Ошибка
zh_hans: 错误

# UI_Answer
source: Answer
ru: Ответ
zh_hans: 答案

# UI_Choose
source: Choose
ru: Выбрать
zh_hans: 选择

# UI_LoadOnlyFreeModels
source: Load only free models
ru: Загружать только бесплатные модели
zh_hans: 仅加载免费模型

# UI_OpenInEditor
source: Open in main editor...
ru: Открыть в основном редакторе...
zh_hans: 在主编辑器中打开...

# UI_Prompt
source: Prompt
ru: Запрос
zh_hans: 提示

# UI_UpdatePage
source: Update page...
ru: Обновить страницу...
zh_hans: 更新页面...

# UI_RemoveChat
source: Remove chat
ru: Удалить чат
zh_hans: 删除聊天

# UI_StartDiscussion
source: Start chat...
ru: Начать чат...
zh_hans: 开始会话...

# UI_StopWaiting
source: Stop
ru: Остановить
zh_hans: 停止

source: FreeAIr available support
ru: FreeAIr доступная поддержка:
zh_hans: FreeAIr 可用支持

source: Start discussion
ru: Начать дискуссию
zh_hans: 开始会话

source: Its prompt template
ru: Шаблон промпта
zh_hans: 它的提示模板

# AI_is_getting_colder
source: AI is getting colder, it nothing is asked about
ru: ИИ остывает, его ни о чем не спрашивают
zh_hans: AI 闲置中

source: Some tasks are in progress
ru: Задача в работе
zh_hans: 有任务正在进行中

source: Status is unknown
ru: Состояние неизвестно
zh_hans: 状态未知

source: Build Natural Language Outlines Json File
ru: Создание NLO Json файла
zh_hans: 构建自然语言大纲 JSON 文件

source: Natural Language Outlines file path
ru: Путь к файлу NLO
zh_hans: 自然语言大纲文件路径

# UI_CompleteRebuild
source: Complete rebuild
ru: Полностью перестроить
zh_hans: 完全重建

source: Force use chosen NLO agent
ru: Принудительно использовать выбранного NLO агента
zh_hans: 强制使用选定的 NLO 代理

source: NLO extract action:
ru: Действия для извлечения NLO:
zh_hans: NLO 提取操作:

source: NLO extract agent:
ru: Агент извлечения NLO:
zh_hans: NLO 提取代理:

source: Embedding generate agent:
ru: Агент генерации эмбеддинга:
zh_hans: 嵌入生成代理:

# Start process to actualize NLO Json file
source: Start process to actualize NLO Json file. Log of the process is in Visual Studio output pane
ru: Начать процесс актуализации NLO Json файла. Логгирование процесса осуществляется в Visual Studio output панель.
zh_hans: 开始更新 NLO Json 文件进程。进程日志位于 Visual Studio 输出窗格中

# NLOG_Tooltip10
source: NLO embedding file(s) path depends on solution name. These files are useful for natural language search feature of FreeAIr. FreeAIr will use these embeddings to narrow down the search scope. It is recommended to actualize these files before every commit to keep embeddings in sync with your codebase.
ru: Путь к файлам встраивания NLO зависит от имени солюшена. Эти файлы полезны для функции поиска на человеческом языке FreeAIr. FreeAIr будет использовать эти эмбеддинги для сужения области поиска. Рекомендуется актуализировать эти файлы перед каждым коммитом, чтобы эмбеддинги синхронизировались с вашей кодовой базой.
zh_hans: NLO 嵌入文件的路径取决于解决方案名称。这些文件对 FreeAIr 的自然语言搜索功能很有用。FreeAIr 将使用这些嵌入来缩小搜索范围。建议在每次提交前更新这些文件，以保持嵌入与您的代码库同步。

# NLOG_Tooltip20
source: Checked tree items will be updated with a new embeddings, unchecked items will reuse the existing embeddings.
ru: Отмеченные элементы дерева будут обновлены новыми эмбеддингами, неотмеченные элементы будут повторно использовать существующие.
zh_hans: 选中的树项目将使用新的嵌入进行更新，未选中的项目将重用现有的嵌入。

# NLOG_Tooltip30
source: FreeAIr process C# files with Roslyn, for any other file 'NLO extract agent' is used. This is an agent to extract natural language outlines from a source file if FreeAIr does not know its syntax tree and cannot extract NLOs from its body natively. If you choose 'Force use chosen NLO agent' then selected agent will be used for every processed file.
ru: FreeAIr обрабатывает файлы C# с помощью Roslyn, для всех остальных файлов используется «агент извлечения NLO». Этот агент извлекает структуры NLO из исходного файла, если FreeAIr не знает его синтаксическое дерево и не может извлечь NLO из его тела нативными средствами. Если выбрать «Принудительно использовать выбранный агент NLO», выбранный агент будет использоваться для каждого обрабатываемого файла.
zh_hans: FreeAIr 使用 Roslyn 处理 C# 文件，对于任何其他文件，则使用“NLO 提取代理”。当 FreeAIr 无法识别源文件的语法树且不能原生提取其内容中的 NLO 时，此代理用于从中提取自然语言大纲。如果您选择“强制使用选定的 NLO 代理”，那么选定的代理将用于处理每个文件。

# NLOG_Tooltip40
source: 'Embedding generate agent' is an agent to generate the embeddings from gathered natural language outlines.
ru: «Агент генерации эмбеддингов» — это агент для генерации эмбеддингов из собранных NLO структур.
zh_hans: “嵌入生成代理”是一个用于从收集的自然语言大纲中生成嵌入的代理。

# NLOG_Tooltip50
source: Natural language outlines are used to apply RAG (retrieval augmented generation) for natural language search, and based on the paper https://arxiv.org/html/2408.04820v4
ru: Собранные NLO используются для генерации эмбеддингов, которые используются для поиска на человеческом языке и основаны на статье https://arxiv.org/html/2408.04820v4
zh_hans: 自然语言大纲用于应用 RAG (检索增强生成) 技术进行自然语言搜索，其原理基于论文 https://arxiv.org/html/2408.04820v4

source: AI chat list
ru: Список чатов с ИИ
zh_hans: AI 聊天列表

source: Open contol center...
ru: Открыть центр управления...
zh_hans: 打开控制中心...

# Edit_FreeAIr_options
source: Edit FreeAIr options. Changes that made do not affects your opened chats.
ru: Редактирование настроек FreeAIr. Измененные настройки не влияют на уже открытые чаты.
zh_hans: 编辑 FreeAIr 选项。所做更改不影响已打开的聊天。

source: Show only user chats
ru: Только чаты пользователя
zh_hans: 仅显示用户聊天

source: Chat context:
ru: Контекст чата:
zh_hans: 聊天上下文:

# Choose this chat agent
source: Choose this chat agent. These changes are not shared across other chats.
ru: Выберите агента для этого чата. Эти изменения не влияют на настройки других чатов.
zh_hans: 选择此聊天代理。这些更改不会在其他聊天中共享。

# Edit the MCP tools for the selected chat
source: Edit the MCP tools for the selected chat. These changes are not shared across other chats.
ru: Редактируйте MCP утилиты этого чата. Эти настройки не влияют на другие чаты.
zh_hans: 为选定聊天编辑 MCP 工具。这些更改不会在其他聊天中共享。

source: Edit chat tools...
ru: Редактировать утилиты чата...
zh_hans: 编辑聊天工具...

source: Add custom file...
ru: Добавить внешний файл...
zh_hans: 添加自定义文件...

source: Remove all automatic found items
ru: Убрать все автоматические итемы
zh_hans: 移除所有自动找到的项目

source: Remove all automatic found items from chat context
ru: Убрать все автоматические итемы из контекста этого чата
zh_hans: 从聊天上下文中移除所有自动找到的项目

source: Delete from context
ru: Удалить из контекста
zh_hans: 从上下文中删除

source: Not started
ru: Не стартовал
zh_hans: 未开始

source: Waiting for answer
ru: Ожидает ответа
zh_hans: 等待应答

source: Reading answer
ru: Чтение ответа
zh_hans: 正在读取应答

source: Ready
ru: Готов
zh_hans: 就绪

source: Failed
ru: Ошибка
zh_hans: 失败

# Choose_chat_agent
source: Choose chat agent{0}...
ru: Выбрать агента для чата{0}...
zh_hans: 选择聊天代理{0}...

# No_dependencies_found__This_may_occurs
source: No dependencies found. This may occurs because Intellisense is not loaded (yet), or the context item is not a .Net source code.
ru: Не найдено зависимостей. Это может произойти, если Intellisense еще не инициализирован, или этот контекстный итем не содержит кода .Net.
zh_hans: 未找到依赖项。这可能是因为智能感知 (Intellisense) 尚未加载，或者上下文项目不是 .NET 源代码。

# Unknown_error_occurred_during_scanning
source: Unknown error occurred during scanning for dependencies
ru: Неизвестная ошибка сканирования зависимостей
zh_hans: 扫描依赖项时发生未知错误

source: Error occurred
ru: Произошла ошибка
zh_hans: 发生错误

source: Started
ru: Стартовал
zh_hans: 已开始

# Please_wait_for_the_code_dependencies
source: Please wait for the code dependencies scanning...
ru: Выполняется поиск зависимостей. Ожидайте...
zh_hans: 请等待代码依赖项扫描...

source: This item came from software logic
ru: Этот итем получен через работу ПО
zh_hans: 此项目来自软件逻辑

source: This item came from user
ru: Этот итем добавлен пользователем
zh_hans: 此项目来自用户

source: Add custom file to chat context
ru: Добавить внешний файл в контекст чата
zh_hans: 添加自定义文件到聊天上下文

# Search_and_add_related_context_items
source: Search and add related context items (.NET only)
ru: Найти и добавить зависимый код (только для .NET)
zh_hans: 搜索并添加相关上下文项目 (仅限 .NET)

source: Open item in new window
ru: Открыть итем в новой вкладке
zh_hans: 在新窗口中打开项目

# Add_new_items_to_context
source: Add to context
ru: Добавить новые итемы в контекст
zh_hans: 添加新项目到上下文

# Add_new_items_to_context1
source: Add to context:
ru: Добавить новые итемы в контекст:
zh_hans: 添加新项目到上下文:

# Press___to_enter_context_items_here
source: Press # to enter context items here. Press Ctrl + Enter to add items to context.
ru: Нажмите # чтобы ввести итемы в это поле. Нажмите Ctrl + Enter чтобы добавить итемы в контекст.
zh_hans: 按 # 在此处输入上下文项目。按 Ctrl + Enter 将项目添加到上下文。

# Enter_your_prompt_here__Press___to
source: Enter your prompt here. Press / to open commands. Press # to choose solution item. Press Ctrl + Enter to send your prompt.
ru: Введите свой промпт сюда. Нажмите / чтобы открыть список команд. Нажмите # чтобы выбрать итемы текущего солюшена. Нажмите Ctrl + Enter чтобы отправить свой промпт.
zh_hans: 在此处输入您的提示。按 / 打开命令。按 # 选择解决方案项目。按 Ctrl + Enter 发送您的提示。

source: Choose OpenRouter model
ru: Выбеерите модель OpenRouter
zh_hans: 选择 OpenRouter 模型

source: FreeAIr Natural Language Outlines
zh_hans: FreeAIr 自然语言大纲

source: Cancel chat
ru: Остановить чат
zh_hans: 取消聊天

source: File Name
ru: Имя файла
zh_hans: 文件名

source: Commented Line
ru: Строка с комментарием
zh_hans: 注释行

source: Comment
ru: Комментарий
zh_hans: 注释

source: Line
ru: Строка
zh_hans: 行号

source: Natural language search results
ru: Результаты поиска на естесственном языке
zh_hans: 自然语言搜索结果

source: Found text
ru: Найденный текст
zh_hans: 找到的文本

source: Confidence
ru: Уверенность
zh_hans: 置信度

source: (cloned)
ru: (склонирован)
zh_hans: (已克隆)

source: Choose model from this api endpoint
ru: Выберите модель для этого API endpoint
zh_hans: 从此 API 端点选择模型

# Choose_the_MCP_tools_you_want_to
source: Choose the MCP tools you want to provide to LLM:
ru: Выберите MCP tools для использования c LLM:
zh_hans: 选择您想提供给 LLM 的 MCP 工具:

# Folder_does_not_exists_yet__Save
source: Folder does not exists yet. Save NLO Json file to create the folder.
ru: Папка еще не существует. Сохраните NLO Json файлы, чтобы создать папку.
zh_hans: 文件夹尚不存在。保存 NLO Json 文件以创建文件夹。

source: (Re)write NLO json file completely...
ru: (Пере)записать NLO json файл полностью...
zh_hans: 完全(重)写 NLO json 文件...

source: Update NLO json file...
ru: Обновить NLO json файл...
zh_hans: 更新 NLO json 文件...

source: Please wait for generating files...
ru: Подождите, пока генерируются файлы...
zh_hans: 请等待文件生成...

source: Starting...
ru: Старт...
zh_hans: 正在启动...

source: Start NLO extraction...
ru: Начато извлечение NLO...
zh_hans: 开始 NLO 提取...

source: Start embedding generation
ru: Начата генерация эмбеддингов
zh_hans: 开始嵌入生成

source: Process SUCESSFULLY completed
ru: Процесс УСПЕШНО завершен
zh_hans: 进程已成功完成

# Choose_agent__with_a_non_empty_token
source: Choose agent (with a non-empty token) for a chat:
ru: Выберите агента (с заполненным токеном) для чата:
zh_hans: 为聊天选择代理(需含非空令牌):

source: Choose the available agent:
ru: Выберите доступного агента:
zh_hans: 选择可用代理:

source: Available agents:
ru: Доступные агенты:
zh_hans: 可用代理:

source: Model list is loading...
ru: Загружается список моделей...
zh_hans: 模型列表加载中...

source: Model list cannot be loaded
ru: Список моделей не может быть загружен
zh_hans: 无法加载模型列表

source: (chosen)
ru: (выбран)
zh_hans: (已选择)

source: Waiting for status
ru: Ожидание статуса
zh_hans: 等待状态

source: Installed and Ready
ru: Установлен и готов
zh_hans: 已安装并就绪

source: Not Installed
ru: Не установлен
zh_hans: 未安装

# Current_json_is_different_from_the
source: Current json is different from the saved one. Consider saving your changes.
ru: Текущий json отличается от сохраненного. Рассмотрите необходимость сохранить Ваши правки.
zh_hans: 当前 JSON 与已保存的不同。请考虑保存您的更改。

# Json_cannot_be_deserialized_because
source: Json cannot be deserialized because of:
ru: Json не может быть десериализован из-за:
zh_hans: JSON 因以下原因无法反序列化:

source: GitHub MCP server installed SUCCESSFULLY.
ru: GitHub MCP сервер установлен УСПЕШНО.
zh_hans: GitHub MCP 服务器安装成功。

# Installation_GitHub_MCP_server_fails
source: Installation GitHub MCP server fails. Please install it manually.
ru: Установка GitHub MCP сервера завершилась с ошибкой. Установите его вручную.
zh_hans: GitHub MCP 服务器安装失败。请手动安装。

source: Options json is not empty. Overwrite?
ru: Json настроек не пуст. Перезаписать?
zh_hans: 选项 JSON 不为空。要覆盖吗?

source: FreeAIr options file does not found
ru: FreeAIr файл настроек не найден
zh_hans: 未找到 FreeAIr 选项文件

# Visual_studio_has_no_active_FreeAIr
source: Visual studio has no active FreeAIr options.
ru: Visual studio не содержит настроек FreeAIr.
zh_hans: Visual Studio 没有活动的 FreeAIr 选项。

source: Invalid json. Fix json and try again.
ru: Некорректный json. Исправьте его и попробуйте снова.
zh_hans: 无效的 JSON。请修复后重试。

# Every_MCP_server_is_found__and_pinged
source: Every MCP server is found, and pinged successfully. Changes was saved successfully.
ru: Каждый MCP сервер найден и успешно пропингован. Изменения были успешно сохранены.
zh_hans: 已找到所有 MCP 服务器并成功 Ping 通。更改已成功保存。

# You_are_going_to_delete_stored_options
source: You are going to delete stored options. Please, confirm.
ru: Вы собираетесь удалить сохраненные настройки. Подтвердите.
zh_hans: 您将要删除已存储的选项。请确认。

source: Options file {0} has been deleted.
ru: Файл настроек {0} был удален.
zh_hans: 选项文件 {0} 已被删除。

# Options_inside_Visual_Studio_has
source: Options inside Visual Studio has been deleted.
ru: Настройки внутри Visual Studio были удалены.
zh_hans: Visual Studio 内的选项已被删除。

source: Click to copy to clipboard
ru: Скопировать в буфер обмена
zh_hans: 点击以复制到剪贴板

# Choose_context_item_to_replace_its
source: Choose context item to replace its content with this code part
ru: Выберите итем контекста для его замены этим кодом
zh_hans: 选择上下文项目以用此代码段替换其内容

# Cannot_replace_context_document_body
source: Cannot replace context document body. Please replace manually.
ru: Невозможно заменить контекстный документ. Сделайте это вручную.
zh_hans: 无法替换上下文文档内容。请手动替换。

# Replace_the_selected_block_of_the
source: Replace the selected block of the code in the VS document with this code part
ru: Заменить выбранный (selected) код внутри документа Visual Studio этим кодом
zh_hans: 用此代码段替换 VS 文档中所选的代码块

# Cannot_replace_selected_text__Please
source: Cannot replace selected text. Please replace the selected text manually.
ru: Невозможно заменить выбранный (selected) код. Сделайте это вручную.
zh_hans: 无法替换所选文本。请手动替换。

source: Create new file with this code part
ru: Создать новый файл с этим кодом
zh_hans: 用此代码段创建新文件

# Cannot_create_a_new_file__Please
source: Cannot create a new file. Please create the file manually.
ru: Невозможно создать новый файл. Сделайте это вручную.
zh_hans: 无法创建新文件。请手动创建文件。

source: Choose context item to replace:
ru: Выберите итем в контексте для его замены:
zh_hans: 选择要替换的上下文项目:

source: MCP server is found, and pinged successfully.
ru: MCP сервер найден и пропингован успешно.
zh_hans: 已找到 MCP 服务器并成功 Ping 通。

source: Idle
ru: Ожидает
zh_hans: 空闲

# No_comments_for_file__0__applied
source: No comments for the file {0} applied
ru: Ни одного комментария не применено к файлу {0}
zh_hans: 文件 {0} 没有应用任何注释

source: No comments applied
ru: Ни одного комментария не применено
zh_hans: 未应用任何注释

source: In progress ({0}/{1})...
ru: В процессе обработки ({0}/{1})...
zh_hans: 进行中 ({0}/{1})...

source: Generated {0} comments:
ru: Сформировано {0} комментариев:
zh_hans: 已生成 {0} 条注释:

source: Cancelled
ru: Отменено
zh_hans: 已取消

# Cannot_determine_the_position_of
source: Cannot determine the position of found entry. The file will be open without selection.
ru: Невозможно определить позицию найденной записи. Файл будет открыт без выделения указанного участка кода.
zh_hans: 无法确定找到的条目的位置。文件将打开但不会选中内容。

source: FreeAIr NLO Json file generation
ru: Генерация файлов NLO Json в FreeAIr
zh_hans: FreeAIr NLO Json 文件生成

# Docker_image_for__0__MCP_server_installed
source: Docker image for {0} MCP server installed. Please setup FreeAIr to work with the server.
ru: Докер образ для MCP сервера {0} успешно установлен. Пожалуйста, настройте FreeAIr для работы с этим сервером.
zh_hans: 用于 {0} MCP 服务器的 Docker 镜像已安装。请设置 FreeAIr 以使用该服务器。

# FreeAIr_Support_Action_Configuration
source: FreeAIr Support Action Configuration Window
ru: FreeAIr Окно выбора
zh_hans: FreeAIr 支持操作配置窗口

source: Add new action
ru: Добавить новое действие
zh_hans: 添加新操作

source: Delete selected action
ru: Удалить выбранное действие
zh_hans: 删除所选操作

source: Move selected action up
ru: Поднять выбранное действие выше
zh_hans: 上移所选操作

source: Move selected action down
ru: Опустить выбранное действие ниже
zh_hans: 下移所选操作

source: Clone
ru: Клонировать
zh_hans: 克隆

source: Apply changes
ru: Применить изменения
zh_hans: 应用更改

source: Agent name
ru: Имя агента
zh_hans: 代理名称

source: Prompt:
ru: Промпт:
zh_hans: 提示:

source: FreeAIr Agent Configuration Window
ru: FreeAIr Окно конфигурации агентов
zh_hans: FreeAIr 代理配置窗口

source: Add new agent
ru: Добавить нового агента
zh_hans: 添加新代理

source: Delete selected agent
ru: Удалить выбранного агента
zh_hans: 删除所选代理

source: Move selected agent up
ru: Поднять выбранного агента наверх
zh_hans: 上移所选代理

source: Move selected agent down
ru: Опустить выбранного агента вниз
zh_hans: 下移所选代理

source: Name:
ru: Имя:
zh_hans: 名称:

source: Endpoint:
zh_hans: 端点:

source: Token:
ru: Токен:
zh_hans: 令牌:

source: Chosen model:
ru: Выбранная модель:
zh_hans: 选定模型:

source: Context size:
ru: Размер контекста:
zh_hans: 上下文大小:

source: Agent system prompt:
ru: Системный промпт агента:
zh_hans: 代理系统提示:

source: Replace with general system prompt...
ru: Заменить стандартным системным промптом...
zh_hans: 替换为通用系统提示...

# Replace_this_system_prompt_with_default
source: Replace this system prompt with default system prompt of general purpose
ru: Заменить этот системный промпт основным системным промптом из FreeAIr
zh_hans: 将此系统提示替换为默认的通用系统提示

# Replace_with_generate_NLO_system
source: Replace with generate NLO system prompt...
ru: Заменить стандартным системным промтом генерации NLO
zh_hans: 替换为生成 NLO 的系统提示...

# Replace_this_system_prompt_with_default_NLO_g
source: Replace this system prompt with default system prompt of generate new or update existing natural language outlines
ru: Заменить этот системный промпт стандартным системным промптом генерации NLO из FreeAIr
zh_hans: 将此系统提示替换为用于生成新的或更新现有自然语言大纲的默认系统提示

source: Replace with extract NLO system prompt...
ru: Заменить стандартным системным промптом извлечения NLO...
zh_hans: 替换为提取 NLO 的系统提示...

# Replace_this_system_prompt_with_default_NLO_s
source: Replace this system prompt with default system prompt of extract natural language outlines from documents.
ru: Заменить этот системный промпт системным промптом извлечения NLO из документа из FreeAIr
zh_hans: 将此系统提示替换为用于从文档中提取自然语言大纲的默认系统提示

source: FreeAIr Control Center
ru: Центр управления FreeAIr
zh_hans: FreeAIr 控制中心

source: Use default...
ru: Использовать по умолчанию...
zh_hans: 使用默认...

source: Reload
ru: Перезагрузить
zh_hans: 重新加载

source: Save
ru: Сохранить
zh_hans: 保存

source: Delete
ru: Удалить
zh_hans: 删除

source: Edit agents...
ru: Редактировать агентов...
zh_hans: 编辑代理...

source: Edit actions...
ru: Редактировать действия...
zh_hans: 编辑操作...

source: Edit MCP servers...
ru: Редактировать MCP сервера...
zh_hans: 编辑 MCP 服务器...

source: Edit global MCP tools...
ru: Редактировать глобальные MCP tools...
zh_hans: 编辑全局 MCP 工具...

source: Github MCP Server status:
ru: Статус Github MCP сервера:
zh_hans: GitHub MCP 服务器状态:

source: Install Github MCP server...
ru: Установить Github MCP сервер...
zh_hans: 安装 GitHub MCP 服务器...

# FreeAIr_options_can_be_saved_into
source: FreeAIr options can be saved into 2 locations:
ru: Настройки FreeAIr могут быть сохранены в 2 разных места:
zh_hans: FreeAIr 选项可以保存在两个位置:

# Json_file__solution_related_approach
source: 1. Json file on the disk (solution-related approach).
ru: 1. Json файл за диске (solution-related подход).
zh_hans: 1. 磁盘上的 JSON 文件(与解决方案相关的方式)。

# a_2__Inside_your_Visual_Studio__developer
source: 2. Inside your Visual Studio (developer-related approach).
ru: 2. Внутри Вашей Visual Studio (developer-related подход).
zh_hans: 2. 在您的 Visual Studio 内部(与开发者相关的方式)。

# Json_file_is_placed_in_the_folder
source: Json file is placed in the folder of your solution + '.freeair' folder + 'your_solution_name>_options.json' filename. This file is a subject of committing to the git repo. This is useful for a command working, when every member of the team can use the same FreeAIr options, for example, connection to the company's LLM.
ru: Json файл расположен в папке Вашего solution, внутри подпапки `.freeair` и имеет имя 'имя_вашего_солюшена>_options.json'. Этот файл подлежит камиту в git, что полезно для командной работы, когда каждый член команды может использовать общие (общепроектные) настройки FreeAIr, например, корпоративного LLM агента.
zh_hans: JSON 文件位于您的解决方案文件夹 + '.freeair' 文件夹 + '你的解决方案名称>_options.json' 文件名。此文件应提交到 Git 仓库。这对于团队协作非常有用，团队中的每个成员都可以使用相同的 FreeAIr 选项，例如连接到公司的 LLM。

# Visual_Studio_is_a_developer_related
source: Visual Studio is a developer-related way, no FreeAIr artifacts falls in your github repo. The same FreeAIr options will be applied for every solution you opened.
ru: Сохранение настроек FreeAIr в Visual Studio это devloper-related подход, Ваш репозиторий не будет захламлен файла FreeAIr. Эти настройки будут применяться к каждому открываемому солюшену.
zh_hans: Visual Studio 是一种与开发者相关的方式，不会有 FreeAIr 的文件进入您的 GitHub 仓库。相同的 FreeAIr 选项将应用于您打开的每个解决方案。

# If_you_have_both__json_file_and
source: If you have both (json file and VS options) FreeAIr will use json file options. If you have nothing FreeAIr will use the default (embedded) options, which are useless for chat with LLM.
ru: Если у Вас настройки FreeAIr сохранены в Visual Studio и Вы открыаете репозиторий с json файлом настроек FreeAIr, то выбраны будут настройки из файла. Если у Вас нет настроек FreeAIr нигде, то будут использоваться дефолтные настройки FreeAIr, которые в целом бесполезны.
zh_hans: 如果您同时拥有 JSON 文件和 VS 选项，FreeAIr 将优先使用 JSON 文件中的选项。如果您没有任何配置，FreeAIr 将使用默认(嵌入式)选项，但这些选项对于与 LLM 聊天是无效的。

# FreeAIr_MCP_Servers_Configuration
source: FreeAIr MCP Servers Configuration Window
ru: Окно настройки MCP серверов FreeAIr
zh_hans: FreeAIr MCP 服务器配置窗口

source: Add new
ru: Добавить
zh_hans: 新增

source: Delete selected
ru: Удалить
zh_hans: 删除所选

source: Move selected up
ru: Поднять
zh_hans: 上移所选

source: Move selected down
ru: Опустить
zh_hans: 下移所选

# Search_for_MCP_servers_in_Docker
source: Search for MCP servers in Docker registry...
ru: Искать MCP сервера в регистре докера...
zh_hans: 在 Docker 仓库中搜索 MCP 服务器...

source: Check for connection...
ru: Проверить подключение...
zh_hans: 检查连接...

source: Install and setup...
ru: Установить и настроить...
zh_hans: 安装并设置...

source: Open in browser...
ru: Открыть в браузере...
zh_hans: 在浏览器中打开...

source: Cancel
ru: Отменить
zh_hans: 取消

source: Show release notes
ru: Показать release notes
zh_hans: 显示发行说明

source: Not interested
ru: Скрыть
zh_hans: 不感兴趣

source: Choose searching scope:
ru: Выберите область поиска:
zh_hans: 选择搜索范围:

source: Whole solution
ru: Весь solution
zh_hans: 整个解决方案

source: Current project
ru: Текущий проект
zh_hans: 当前项目
