Repository: lsoft/FreeAIr
Catalog: FreeAIr/Resources/Resources.*.resx
Languages: ru, zh_hans

source: Choose support action:
ru: Выберите действие:
zh_hans: 选择支持操作:

# Choose_agent_for_natural_language
source: Choose agent for natural language search:
ru: Выберите агента для поиска на естесственном языке:
zh_hans: 选择用于自然语言搜索的代理:

source: Use RAG
ru: Использовать RAG
zh_hans: 使用 RAG

source: Find using natural language
ru: Искать на естесственном языке
zh_hans: 使用自然语言查找

# Find_using_natural_language_in_current
source: Find using natural language in current solution or the current project
ru: Искать на естесственном языке во всем солюшене или в текущем проекте
zh_hans: 在当前解决方案或当前项目中使用自然语言查找

source: Choose agent for commit message generation:
ru: Выберите агента для создания commit-сообщения:
zh_hans: 选择用于生成提交消息的代理:

# Cannot_collect_git_patch__Please
source: Cannot collect git patch. Please enter commit message manually.
ru: Невозможно собрать git patch. Пожалуйста, введите commit-сообщение вручную.
zh_hans: 无法收集 Git 补丁。请手动输入提交消息。

# Cannot_receive_AI_answer__Please
source: Cannot receive LLM answer. Please enter commit message manually.
ru: Невозможно получить ответ от LLM. Пожалуйста, введите сообщение вручную.
zh_hans: 无法收到 LLM 回答。请手动输入提交消息。

source: Please wait for git patch building...
ru: Подождите, пока собирается git patch...
zh_hans: 请等待 Git 补丁构建...

source: Cannot collect git patch.
ru: Невозможно получить git patch.
zh_hans: 无法收集 Git 补丁。

source: Cannot determine git repository path.
ru: Невозможно получить путь к репозиторию git.
zh_hans: 无法确定 Git 仓库路径。

# Choose_agent_to_add_NL_outlines_to
source: Choose agent to add NL outlines to changed files:
ru: Выберите агента для добавления NLO в измененные файлы:
zh_hans: 选择代理为变更文件添加 NL 大纲:

# FreeAIr_support__generate_commit
source: FreeAIr support: generate commit message
ru: FreeAIr: создать commit-сообщение по измененным файлам
zh_hans: FreeAIr 支持: 生成提交消息

# FreeAIr_support__generate_and_add
source: FreeAIr support: generate and add natural language outlines related to the diff below.
ru: FreeAIr: сформировать и добавить NLO в измененные файлы.
zh_hans: FreeAIr 支持: 生成并添加与下方差异相关的自然语言大纲。

# FreeAIr_support__build_natural_language
source: FreeAIr support: build natural language outlines json file related to the diff below.
ru: FreeAIr: извлечь NLO и сформировать NLO json файл для измененных файлов.
zh_hans: FreeAIr 支持: 构建与下方差异相关的自然语言大纲 JSON 文件。

source: New version of FreeAIr has been installed.
zh_hans: 新版本的 FreeAIr 已安装。

# Cannot_edit_the_document__Please
source: Cannot edit the document. Please copy-paste the text manually.
zh_hans: 无法编辑文档。请手动复制粘贴文本。
